      function e141a(x)   ! Функция e141a(x) вычисляет для заданного аргумента
      implicit none       ! ( 0 <= x <= 8 ) значение E1(x)+gamma+ln(x) через
      real*8 x, e141a     ! разложение в ряд по смещенным полиномам Чебышева.
      real*8 a(0:24)      ! Коэффициенты разложения взяты из книги  Ю.Люка
      real*8 w,z          ! Специальные математические функции и их
      real*8 b0, b1, b2   ! аппроксимации. Издательство "МИР". Москва, 1980.
      integer  i          !                          стр. 112 (таблица 4.1).
      data a / 1.67391 43547 42720 57853d0, !
     1         1.22849 44785 47155 95018d0, ! Здесь  
     2        -0.31786 98982 98373 61369d0, ! 
     3         0.09274 60391 97292 19112d0, !     E1(x) - первая интегрально-
     4        -0.02602 73631 69001 19930d0, !             показательная
     5         0.00674 81530 94642 28057d0, !             функция;
     6        -0.00159 89706 89342 25285d0, ! gamma=0.57721 56649 01532 86061 
     7         0.00034 59445 38800 95403d0, !
     8        -0.00006 85365 26820 11094d0, !   (постоянная Эйлера)
     9         0.00001 24859 32391 73701d0,
     A        -0.00000 21013 44638 71704d0,
     1         0.00000 03281 84479 81081d0,
     2        -0.00000 00477 68786 45154d0,
     3         0.00000 00065 05816 88192d0,
     4        -0.00000 00008 32101 93692d0,
     5         0.00000 00001 00281 01125d0,
     6        -0.00000 00000 11422 29304d0,
     7         0.00000 00000 01233 07945d0,
     8        -0.00000 00000 00126 48523d0,
     9         0.00000 00000 00012 35706d0,
     B        -0.00000 00000 00001 15226d0,
     1         0.00000 00000 00000 10276d0,
     2        -0.00000 00000 00000 00878d0,
     3         0.00000 00000 00000 00072d0,
     4        -0.00000 00000 00000 00006d0 /
      w=0.125d0*x
      z=4d0*w-2d0
      b0=0d0
      b1=0d0
      do i=24,0,-1
        b2=b1
        b1=b0
        b0=z*b1-b2+a(i)
      enddo
      e141a=b0-b1*z/2d0
      end
