program main
implicit none

external f

!-----------QUADRA---------------

real(8) f
real(8) rectan, trap, sim

integer n                                  
real(8) a, b                                      

!-----------QUADRA---------------

write(*,'(/,a,/)') ' QUADRA '

!-----------------------------------------------------------------------------

read(*,*) a, b, n

write(*,'(a,/)') ' Формула средних прямоугольников '

write(*,*) 'Был задан промежуток: от ', a, 'до ', b, '.'
write(*,*) 'Будут рассмотрены первые ', n, 'значений(-я).'

write(*,*) 'Rectan:'
write(*,*) 'Integral=~', rectan(f, a, b, n) 

write(*,'(//)')

!-----------------------------------------------------------------------------

write(*,'(/,a,/)') ' Формула трапеций '

write(*,*) 'Был задан промежуток: от ', a, 'до ', b, '.'
write(*,*) 'Будут рассмотрены первые ', n+1, 'значений(-я).'

write(*,*) 'Trap:'
write(*,*) 'Integral=~', trap(f, a, b, n) 

write(*,'(//)')

!-----------------------------------------------------------------------------

write(*,'(/,a,/)') ' Формула Симпсона (парабол) '

write(*,*) 'Был задан промежуток: от ', a, 'до ', b, '.'
write(*,*) 'Будут рассмотрены первые ', n+1, 'значений(-я).'

write(*,*) 'Sim:'
write(*,*) 'Integral=~', sim(f, a, b, n)

write(*,'(//)')

end
