program main
use poly
use binrad
use quadra

integer n, i,  v, n_r   !  a, b,
!real y, y2, y4, yn4
real(8) a_r, b_r, x_r, h_r
real,dimension(100) :: m
real x
integer, dimension(100)::t
integer count(-16:16)
real    treal(100)
integer res41(32), res42(32)
integer, dimension(8)::binar_def
integer binar(8)
real(8), dimension(1000)::domain

write(*,'(a/)') 'Задача N 1: '

read(*,'(i10)') n
write(*,*) 'Введенная степень: ', n
read(*,'(e10.3)') (m(i),i=1,n+1)
write(*,*) 'Введенные коэффициенты, начиная со старшей степени: '
write(*,'(i3,e15.7)') (i,m(i),i=1,n+1)
read(*,'(e10.3)') x
write(*,*) 'Poly1: '
write(*,*) poly1(n,x,m)
write(*,*) poly1(n,-x,m)
write(*,'(30("=")/)')
write(*,'(a/)') 'Задача N 2: '

write(*,*) 'Введенная точка, в которой хотите узнать значение: ', x
write(*,*) 'Poly2: '
write(*,*) poly2(x, m, n)
write(*,'(30("=")/)')
!---------------------------------------------------------
write(*,'(a/)') 'Задача N 3: '

write(*,*) 'Задание массива через IRAND'
do i=1,n
  t(i)=mod(irand(0),33)-16 
enddo
write(*,'(i3, 3x, i7)') (i,t(i),i=1,n)

write(*,*) 'Задание массива через RANDON_NUMBER'

call random_number(treal)
write(*,*) huge(1)
write(*,*) huge(1)* treal(1:n)
write(*,*) int(huge(1)* treal(1:n))
write(*,*) mod(int(huge(1)* treal(1:n)),33)
write(*,*) mod(int(huge(1)* treal(1:n)),33) -17
t(1:n)= mod(int(huge(1)* treal(1:n)),33) -17

write(*,'(i3, 3x, i7)') (i,t(i),i=1,n)


write(*,*) 'Введен массив: '
write(*,'(i3,3x,i15)') (i,t(i),i=1,n)
count=poly3(n,t)

write(*,*) 'Значение Число встреч: '

do i=-16,16
  if (count(i)/=0) write(*,'(i3,i7)') i,count(i)    !poly3(n,t)
enddo
write(*,'(30("=")/)')

!---------------------------------------------------------
write(*,'(a/)') 'Задача N 4: '
read(*,*) v
write(*,*) 'Было введено целое число v: ', v
write(*,*) ' '
write(*,'(a,B32.32)')  ' v=', v ! Это контроль того, что должна
write(*,'(a,B32.32)')  '-v=',-v ! получить Ваша poly4

write(*,*) 'Poly4: '
write(*,*) 'Двоичное представление:'

res41=poly4( v); write(*,'(" v=",32i1)') (res41(i),i=32,1,-1)
res42=poly4(-v); write(*,'("-v=",32i1)') (res42(i),i=32,1,-1)
!======================================================================
!
! Сравните Ваш результат с контрольным и подправьте, пожалуйста свой
! алгоритм. После того, как тестирование пройдёт для -6, попробуйте
! тест для числа 32 


write(*,'(30("=")/)')
!---------------------------------------------------------
write(*,'(a/)') 'Задача N 5: '

read(*,*) binar_def
binar=binar_def
write(*,'(a,8i1)') 'Был введен набор нулей и единиц: ', binar
!do i=1,8
!  write(*,'(i1,"...",i2)') i,binar(i)
!enddo
write(*,*) 'Binrad5:'
write(*,'("Число в десятичной системе счисления:", i15)') binrad5(binar)

!write(*,'(a,b8.8)') '(+11)_10=', int(11,1)  ! По умолчанию целочисленные
!write(*,'(a,b8.8)') '(-11)_10=', int(-11,1) ! константы 4-х байтовые
                                             ! Вы моделируете однобайтовую
                                             ! раз только 8 элементов.
                                             ! Поэтому в списке вывода надо 
                                             ! выводимое четырёхбайтовое
! сначала преобразовать к типу integer(1) (второй аргумент функции int ---
! ключ разновидности типа. Он равен числу байт в типе).

!write(*,'(a,B8)')  ' v=', 7

! П: Оставил 4-х байтовую в функции, так как все равно есть ограничение на
!    диапазон результатов.

write(*,'(30("=")/)')
!---------------------------------------------------------
write(*,'(a/)') 'Задача N 6: '

binar=binar_def
write(*,*) 'Binrad6:'
write(*,'(a,8i1)') 'Был введен набор нулей и единиц: ', binar

write(*,'("Восьмеричная система счисления:  ",8i1)') binrad6(binar)  ! П: Да-да, была лишняя a в выводе.
!write(*,'(a,8i1)') 'Восьмеричная система счисления :', b            !    Исправил.



!Задача N 6: 

! Binrad6:
!Был введен набор нулей и единиц: 00001011
!Восьмеричная система счисления:   \00\00\00\000000013
!                                  --------
!                                      |---= Устраните эти кракозябры!

!                    Как исправить ситуацию     ????


write(*,'(30("=")/)')
!---------------------------------------------------------

! QUADRA
write(*,*) 'QUADRA'
write(*,*) ' '

read(*,*) a_r, b_r, n_r
write(*,*) 'Был задан промежуток: от ', a_r, 'до ', b_r, '.'
write(*,*) 'Будут рассмотрены первые ', n_r, 'значений(-я).'

h_r=(b_r-a_r)/n_r

write(*,*) ' h_r=',h_r
do i=1, size(domain), 1
  domain(i)=0
enddo

do i=1, n_r, 1
  x_r=a_r+(i-0.5)*h_r
  domain(i)=your_function(x_r)
enddo

write(*,*) 'Был получен массив значений domain:'
write(*,'(i3,e15.7)') (i,domain(i),i=1,n_r)

write(*,*) 'Rectan:'
write(*,'("Integral=~",e25.16)') rectan(domain, a_r, b_r, n_r) 


end
