program main
use functions
implicit none

integer a(3, 4, 5) / 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, &
10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, &
100, 200, 300, 400, 500, 600, 700, 800, 900, 1000, 1100, 1200, &
1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000, 11000, 12000, &
10000, 20000, 30000, 40000, 50000, 60000, 70000, 80000, 90000, 100000, 110000, 120000 /
integer k

write(*,*) a

write(*,*) 'Введите номер слоя:' 
read(*,*) k
write(*,*) 'sxy(a,k):', sxy(a,k)
write(*,*) 'sxz(a,k):', sxz(a,k)
write(*,*) 'syz(a,k):', syz(a,k)

end program main
