module actual
use real_type
implicit none

contains

real(mp) function actual_function(x)
use real_type
implicit none
real(mp) x, xx

xx=x*x
actual_function=(e141(x)-e141(x/2.0_mp)+log(2.0_mp)-x/2.0_mp*(1.0_mp-3.0_mp*xx/8.0_mp))*144.0_mp/(7.0_mp*xx*x)

end function actual_function

real(mp) function e141(x)
use real_type                         ! Функция e141(x) вычисляет для 
implicit none                         ! аргумента (x) значение первой 
real(mp) x,w,g                        ! интегрально-показательной 
data g /.57721566490153286061_mp /     ! функции E1(x).
if (x .ge. 5.0_mp) then                 ! Расчёт ведется на основе известных
        w=e141c(x)/x*exp(-x)          ! разложений E1(x) в ряд по полиномам
else                                  ! Чебышева (см. книгу Люка: 
        if (x .gt. 0.0_mp) then            ! Специальные математические 
                w=e141a(x)-g-log(x)   !  функции и их аппроксимации.
        else                          ! Издательство "МИР". Москва, 1980.
        w=1.0_mp                        ! стр. 112-113 (таблица 4.1).    
        endif
endif 
e141=w
end function e141

real(mp) function e141a(x)   
use real_type         ! Функция e141a(x) вычисляет для заданного аргумента
implicit none         ! ( 0 <= x <= 8 ) значение E1(x)+gamma+ln(x) через
real(mp) x            ! разложение в ряд по смещенным полиномам Чебышева.
real(mp) a(0:24)      ! Коэффициенты разложения взяты из книги  Ю.Люка
real(mp) w,z          ! Специальные математические функции и их
real(mp) b0, b1, b2   ! аппроксимации. Издательство "МИР". Москва, 1980.
integer  i          !                          стр. 112 (таблица 4.1).
data a / 1.67391435474272057853_mp, &!
&  1.22849447854715595018_mp, &! Здесь  
& -0.31786989829837361369_mp, &! 
&  0.09274603919729219112_mp, &!     E1(x) - первая интегрально-
& -0.02602736316900119930_mp, &!             показательная
&  0.00674815309464228057_mp, &!             функция;
& -0.00159897068934225285_mp, &! gamma=0.57721566490153286061 
&  0.00034594453880095403_mp, &!
& -0.00006853652682011094_mp, &!   (постоянная Эйлера)
&  0.00001248593239173701_mp, &
& -0.00000210134463871704_mp, &
&  0.00000032818447981081_mp, &
& -0.00000004776878645154_mp, &
&  0.00000000650581688192_mp, &
& -0.00000000083210193692_mp, &
&  0.00000000010028101125_mp, &
& -0.00000000001142229304_mp, &
&  0.00000000000123307945_mp, &
& -0.00000000000012648523_mp, &
&  0.00000000000001235706_mp, &
& -0.00000000000000115226_mp, &
&  0.00000000000000010276_mp, &
& -0.00000000000000000878_mp, &
&  0.00000000000000000072_mp, &
& -0.00000000000000000006_mp /

w=0.125_mp*x
z=4.0_mp*w-2.0_mp
b0=0.0_mp
b1=0.0_mp

do i=24,0,-1
        b2=b1
        b1=b0
        b0=z*b1-b2+a(i)
enddo

e141a=b0-b1*z/2.0_mp

end function e141a

real(mp) function e141c(x)
use real_type        ! Функция e141c(x) вычисляет для заданного аргумента
implicit none        ! ( x >= 5 ) значение выражения E1(x)*exp(x)*x через
real(mp) x           ! его разложение в ряд по смещённым полиномам Чебышева.
real(mp) c(0:30)     ! Коэффициенты разложения взяты из книги 
real(mp) w,z         ! Ю.Люка  Специальные математические функции и их
real(mp) b0,b1,b2    !  аппроксимации. Издательство "МИР". Москва, 1980.
integer i            ! стр. 112-113 (таблица 4.1 (c)). 
data c / 0.92078514445389391645_mp, &
& -0.07343411783162128775_mp, &
&  0.00520981196727232977_mp, &
& -0.00050214071989599012_mp, &
&  0.00005920796937926337_mp, &
& -0.00000808564513097880_mp, &
&  0.00000123720385647926_mp, &
& -0.00000020750176860703_mp, &
&  0.00000003756005474022_mp, &
& -0.00000000725410976004_mp, &
&  0.00000000148181601182_mp, &
& -0.00000000031795682863_mp, &
&  0.00000000007126935828_mp, &
& -0.00000000001661231319_mp, &
&  0.00000000000401155069_mp, &
& -0.00000000000100038792_mp, &
&  0.00000000000025693341_mp, &
& -0.00000000000006780374_mp, &
&  0.00000000000001834785_mp, &
& -0.00000000000000508209_mp, &
&  0.00000000000000143861_mp, &
& -0.00000000000000041560_mp, &
&  0.00000000000000012238_mp, &
& -0.00000000000000003669_mp, &
&  0.00000000000000001119_mp, &
& -0.00000000000000000347_mp, &
&  0.00000000000000000109_mp, &
& -0.00000000000000000035_mp, &
&  0.00000000000000000011_mp, &
& -0.00000000000000000004_mp, &
&  0.00000000000000000001_mp /
 
w=5.0_mp/x
z=4.0_mp*w-2.0_mp
b0=0.0_mp
b1=0.0_mp

do i=30,0,-1
        b2=b1
        b1=b0
        b0=z*b1-b2+c(i)
enddo

e141c=b0-b1*z/2.0_mp

end function e141c

end module actual
